Tekla.Structures.Drawing.UI.DrawingSelector
The DrawingSelector class provides functionality for accessing the drawing list dialog.
The following example deletes the selected drawings:
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
DrawingEnumerator SelectedDrawings = MyDrawingHandler.GetDrawingSelector().GetSelected();
while(SelectedDrawings.MoveNext())
{
SelectedDrawings.Current.Delete();
}
}
}
}

Tekla.Structures.Drawing.UI.DrawingSelector.GetSelected
Gets the drawings that are currently selected in the drawing list dialog.
Returns: The drawings that are currently selected in the drawing list dialog.